espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_crypto.h
/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Set the modulus type used for wide arithmetic operations.
 *
 * @details
 *   This function sets the modulus type to be used by the modulus instructions
 *   of the CRYPTO module.
 *
 * @param[in]  crypto
 *   A pointer to the CRYPTO peripheral register block.
 *
 * @param[in]  modulusId
 *   A modulus type.
 ******************************************************************************/
void CRYPTO_ModulusSet(CRYPTO_TypeDef *          crypto,
                       CRYPTO_ModulusId_TypeDef  modulusId);

/***************************************************************************//**
 * @brief
 *   Set the number of bits in the operands of the MUL instruction.
 *
 * @details
 *   This function sets the number of bits to be used in the operands of
 *   the MUL instruction.
 *
 * @param[in]  crypto
 *   A pointer to the CRYPTO peripheral register block.
 *
 * @param[in]  mulOperandWidth
 *   Multiplication width in bits.
 ******************************************************************************/
__STATIC_INLINE
void CRYPTO_MulOperandWidthSet(CRYPTO_TypeDef *crypto,
                               CRYPTO_MulOperandWidth_TypeDef mulOperandWidth)
{
  uint32_t temp = crypto->WAC & (~_CRYPTO_WAC_MULWIDTH_MASK);
  crypto->WAC = temp | (uint32_t)mulOperandWidth;
}

/***************************************************************************//**
 * @brief
 *   Set the width of the results of the non-modulus instructions.
 *
 * @details
 *   This function sets the result width of the non-modulus instructions.
 *
 * @param[in]  crypto
 *   A pointer to the CRYPTO peripheral register block.
 *
 * @param[in]  resultWidth
 *   A result width of non-modulus instructions.
 ******************************************************************************/
__STATIC_INLINE
void CRYPTO_ResultWidthSet(CRYPTO_TypeDef *crypto,
                           CRYPTO_ResultWidth_TypeDef resultWidth)
{
  uint32_t temp = crypto->WAC & (~_CRYPTO_WAC_RESULTWIDTH_MASK);
  crypto->WAC = temp | (uint32_t)resultWidth;
}

/***************************************************************************//**
 * @brief
 *   Set the width of the DATA1 increment instruction DATA1INC.
 *
 * @details
 *   This function sets the width of the DATA1 increment instruction
 *   CRYPTO_CMD_INSTR_DATA1INC.
 *
 * @param[in]  crypto
 *   A pointer to CRYPTO peripheral register block.
 *
 * @param[in]  incWidth
 *   An incrementation width.
 ******************************************************************************/
__STATIC_INLINE void CRYPTO_IncWidthSet(CRYPTO_TypeDef *crypto,
                                        CRYPTO_IncWidth_TypeDef incWidth)
{
  uint32_t temp = crypto->CTRL & (~_CRYPTO_CTRL_INCWIDTH_MASK);
  crypto->CTRL = temp | (uint32_t)incWidth;
}

/***************************************************************************//**
 * @brief
 *   Write a 128 bit value into a crypto register.
 *
 * @note
 *   This function provides a low-level API for writing to the multi-word
 *   registers in the crypto peripheral. Applications should use
 *   @ref CRYPTO_DataWrite, @ref CRYPTO_DDataWrite or @ref CRYPTO_QDataWrite
 *   for writing to DATA, DDATA, and QDATA registers.
 *
 * @param[in]  reg
 *   A pointer to the crypto register.
 *
 * @param[in]  val
 *   This is a pointer to 4 32 bit integers that contains the 128 bit value
 *   which will be written to the crypto register.
 ******************************************************************************/
void CRYPTO_BurstToCrypto(volatile uint32_t * reg,
                          const uint32_t * val);

/***************************************************************************//**
 * @brief
 *   Read a 128 bit value from a crypto register.
 *
 * @note
 *   This function provides a low-level API for reading one of the multi-word
 *   registers in the crypto peripheral. Applications should use
 *   @ref CRYPTO_DataRead, @ref CRYPTO_DDataRead or @ref CRYPTO_QDataRead
 *   for reading the value of DATA, DDATA, and QDATA registers.
 *
 * @param[in]  reg
 *   A pointer to the crypto register.
 *
 * @param[out]  val
 *   This is a pointer to an array that is capable of holding 4 32 bit integers
 *   that will be filled with the 128 bit value from the crypto register.
 ******************************************************************************/
void CRYPTO_BurstFromCrypto(volatile uint32_t * reg, uint32_t * val);

/***************************************************************************//**
 * @brief
 *   Write 128 bits of data to a DATAX register in the CRYPTO module.
 *
 * @details
 *   Write 128 bits of data to a DATAX register in the crypto module. The data
 *   value is typically input to a big integer operation (see crypto
 *   instructions).
 *
 * @param[in]  dataReg    The 128 bit DATA register.
 * @param[in]  val        Value of the data to write to the DATA register.
 *                        Has to be word-aligned.
 ******************************************************************************/
void CRYPTO_DataWrite(CRYPTO_DataReg_TypeDef dataReg,
                      const CRYPTO_Data_TypeDef val);

/***************************************************************************//**
 * @brief
 *   Write 128 bits of unaligned data to a DATAX register in the CRYPTO module.
 *
 * @details
 *   Write 128 bits of unaligned data to a DATAX register in the CRYPTO module.
 *   The data pointer does not have to be word-aligned, but an unaligned pointer
 *   might incur a performance hit.
 *
 * @param[in]  reg    The 128 bit DATA register.
 * @param[in]  val    Pointer to value to write to the DATA register.
 *                    Can be unaligned.
 ******************************************************************************/
CRYPTO_WARNINGS_NO_CAST_ALIGN
void CRYPTO_DataWriteUnaligned(volatile uint32_t * reg,
                               const uint8_t * val);
CRYPTO_WARNINGS_RESET

/***************************************************************************//**
 * @brief
 *   Read 128 bits of data from a DATAX register in the CRYPTO module.
 *
 * @details
 *   Read 128 bits of data from a DATAX register in the crypto module. The data
 *   value is typically output from a big integer operation (see crypto
 *   instructions)
 *
 * @param[in]  dataReg   The 128 bit DATA register.
 * @param[out] val       Location where to store the value in memory.
 *                       Has to be word-aligned.
 ******************************************************************************/
void CRYPTO_DataRead(CRYPTO_DataReg_TypeDef  dataReg,
                     CRYPTO_Data_TypeDef     val);

/***************************************************************************//**
 * @brief
 *   Read 128 bits of data from a DATAX register in the CRYPTO module to an
 *   unaligned pointer.
 *
 * @details
 *   Write 128 bits of unaligned data to a DATAX register in the CRYPTO module
 *   to an unaligned pointer. The output pointer does not have to be
 *   word-aligned, but an unaligned pointer might incur a performance penalty.
 *
 * @param[in]  reg    The 128 bit DATA register.
 * @param[out] val    Location where to store the value in memory.
 *                    Can be unaligned.
 ******************************************************************************/
CRYPTO_WARNINGS_NO_CAST_ALIGN
void CRYPTO_DataReadUnaligned(volatile uint32_t * reg,
                              uint8_t * val);
CRYPTO_WARNINGS_RESET

/***************************************************************************//**
 * @brief
 *   Write 256 bits of data to a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Write 256 bits of data into a DDATAX (Double Data) register in the crypto
 *   module. The data value is typically input to a big integer operation (see
 *   crypto instructions).
 *
 * @param[in]  ddataReg   The 256 bit DDATA register.
 * @param[in]  val        Value of the data to write to the DDATA register.
 ******************************************************************************/
void CRYPTO_DDataWrite(CRYPTO_DDataReg_TypeDef ddataReg,
                       const CRYPTO_DData_TypeDef val);

/***************************************************************************//**
 * @brief
 *   Read 256 bits of data from a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Read 256 bits of data from a DDATAX (Double Data) register in the crypto
 *   module. The data value is typically output from a big integer operation
 *   (see crypto instructions).
 *
 * @param[in]  ddataReg   The 256 bit DDATA register.
 * @param[out] val        Location where to store the value in memory.
 ******************************************************************************/
void CRYPTO_DDataRead(CRYPTO_DDataReg_TypeDef  ddataReg,
                      CRYPTO_DData_TypeDef     val);

/***************************************************************************//**
 * @brief
 *   Write 512 bits of data to a QDATAX register in the CRYPTO module.
 *
 * @details
 *   Write 512 bits of data into a QDATAX (Quad Data) register in the crypto module
 *   The data value is typically input to a big integer operation (see crypto
 *   instructions).
 *
 * @param[in]  qdataReg   The 512 bits QDATA register.
 * @param[in]  val        Value of the data to write to the QDATA register.
 ******************************************************************************/
void CRYPTO_QDataWrite(CRYPTO_QDataReg_TypeDef qdataReg,
                       const CRYPTO_QData_TypeDef val);

/***************************************************************************//**
 * @brief
 *   Read 512 bits of data from a QDATAX register in the CRYPTO module.
 *
 * @details
 *   Read 512 bits of data from a QDATAX register in the crypto module. The data
 *   value is typically input to a big integer operation (see crypto
 *   instructions).
 *
 * @param[in]  qdataReg   The 512 bits QDATA register.
 * @param[in]  val        Value of the data to write to the QDATA register.
 ******************************************************************************/
void CRYPTO_QDataRead(CRYPTO_QDataReg_TypeDef qdataReg,
                      CRYPTO_QData_TypeDef    val);

/***************************************************************************//**
 * @brief
 *   Set the key value to be used by the CRYPTO module.
 *
 * @details
 *   Write 128 or 256 bit key to the KEYBUF register in the crypto module.
 *
 * @param[in]  crypto
 *   A pointer to the CRYPTO peripheral register block.
 *
 * @param[in]  val
 *   Value of the data to write to the KEYBUF register. Has to be word-aligned.
 *
 * @param[in]  keyWidth
 *   Key width - 128 or 256 bits.
 ******************************************************************************/
void CRYPTO_KeyBufWrite(CRYPTO_TypeDef          *crypto,
                        CRYPTO_KeyBuf_TypeDef    val,
                        CRYPTO_KeyWidth_TypeDef  keyWidth);

/***************************************************************************//**
 * @brief
 *   Set the key value to be used by the CRYPTO module.
 *
 * @details
 *   Write 128 or 256 bit key to the KEYBUF register in the crypto module. The
 *   input key buffer does not have to be word-aligned, but an unaligned value
 *   might incur a performance penalty.
 *
 * @param[in]  crypto
 *   A pointer to the CRYPTO peripheral register block.
 *
 * @param[in]  val
 *   Pointer to value to write to the KEYBUF register. Can be unaligned.
 *
 * @param[in]  keyWidth
 *   Key width - 128 or 256 bits.
 ******************************************************************************/
CRYPTO_WARNINGS_NO_CAST_ALIGN
void CRYPTO_KeyBufWriteUnaligned(CRYPTO_TypeDef          *crypto,
                                 const uint8_t *          val,
                                 CRYPTO_KeyWidth_TypeDef  keyWidth);
CRYPTO_WARNINGS_RESET

