espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_crypto.h
/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */
/*******************************************************************************
 *****    Static inline wrappers for CRYPTO AES functions to      *****
 *****    preserve backwards compatibility with AES module API functions.  *****
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   AES Cipher-block chaining (CBC) cipher mode encryption/decryption,
 *   128 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CBC128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CBC128(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv,
                                                          bool encrypt)
{
  CRYPTO_AES_CBC128(DEFAULT_CRYPTO, out, in, len, key, iv, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Cipher-block chaining (CBC) cipher mode encryption/decryption, 256 bit
 *   key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CBC256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CBC256(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv,
                                                          bool encrypt)
{
  CRYPTO_AES_CBC256(DEFAULT_CRYPTO, out, in, len, key, iv, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Cipher feedback (CFB) cipher mode encryption/decryption, 128 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CFB128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CFB128(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv,
                                                          bool encrypt)
{
  CRYPTO_AES_CFB128(DEFAULT_CRYPTO, out, in, len, key, iv, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Cipher feedback (CFB) cipher mode encryption/decryption, 256 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CFB256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CFB256(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv,
                                                          bool encrypt)
{
  CRYPTO_AES_CFB256(DEFAULT_CRYPTO, out, in, len, key, iv, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Counter (CTR) cipher mode encryption/decryption, 128 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CTR128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CTR128(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          uint8_t * ctr,
                                                          CRYPTO_AES_CtrFuncPtr_TypeDef ctrFunc)
{
  CRYPTO_AES_CTR128(DEFAULT_CRYPTO, out, in, len, key, ctr, ctrFunc);
}

/***************************************************************************//**
 * @brief
 *   AES Counter (CTR) cipher mode encryption/decryption, 256 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CTR256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CTR256(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          uint8_t * ctr,
                                                          CRYPTO_AES_CtrFuncPtr_TypeDef ctrFunc)
{
  CRYPTO_AES_CTR256(DEFAULT_CRYPTO, out, in, len, key, ctr, ctrFunc);
}

/***************************************************************************//**
 * @brief
 *   Update last 32 bits of 128 bit counter, by incrementing with 1.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_CTRUpdate32Bit instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_CTRUpdate32Bit(uint8_t * ctr)
{
  CRYPTO_AES_CTRUpdate32Bit(ctr);
}

/***************************************************************************//**
 * @brief
 *   Generate 128 bit AES decryption key from 128 bit encryption key. The
 *   decryption key is used for some cipher modes when decrypting.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_DecryptKey128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_DecryptKey128(uint8_t * out,
                                                                 const uint8_t * in)
{
  CRYPTO_AES_DecryptKey128(DEFAULT_CRYPTO, out, in);
}

/***************************************************************************//**
 * @brief
 *   Generate 256 bit AES decryption key from 256 bit encryption key. The
 *   decryption key is used for some cipher modes when decrypting.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_DecryptKey256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_DecryptKey256(uint8_t * out,
                                                                 const uint8_t * in)
{
  CRYPTO_AES_DecryptKey256(DEFAULT_CRYPTO, out, in);
}

/***************************************************************************//**
 * @brief
 *   AES Electronic Codebook (ECB) cipher mode encryption/decryption,
 *   128 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_ECB128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_ECB128(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          bool encrypt)
{
  CRYPTO_AES_ECB128(DEFAULT_CRYPTO, out, in, len, key, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Electronic Codebook (ECB) cipher mode encryption/decryption,
 *   256 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_ECB256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_ECB256(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          bool encrypt)
{
  CRYPTO_AES_ECB256(DEFAULT_CRYPTO, out, in, len, key, encrypt);
}

/***************************************************************************//**
 * @brief
 *   AES Output feedback (OFB) cipher mode encryption/decryption, 128 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_OFB128 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_OFB128(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv)
{
  CRYPTO_AES_OFB128(DEFAULT_CRYPTO, out, in, len, key, iv);
}

/***************************************************************************//**
 * @brief
 *   AES Output feedback (OFB) cipher mode encryption/decryption, 256 bit key.
 *
 * @deprecated
 *   This function preserves backwards compatibility. Use
 *   @ref CRYPTO_AES_OFB256 instead.
 ******************************************************************************/
__STATIC_INLINE SL_DEPRECATED_API_SDK_4_1 void AES_OFB256(uint8_t * out,
                                                          const uint8_t * in,
                                                          unsigned int len,
                                                          const uint8_t * key,
                                                          const uint8_t * iv)
{
  CRYPTO_AES_OFB256(DEFAULT_CRYPTO, out, in, len, key, iv);
}
/** @endcond */

#ifdef __cplusplus
}
#endif

/** @} (end addtogroup crypto) */

#endif /* defined(CRYPTO_COUNT) && (CRYPTO_COUNT > 0) */

#endif /* EM_CRYPTO_H */
